package game.kivita.chasutnakivitata.Game;

import java.util.ArrayList;

public class Content {


    public static int sceneNum = 0;

    public static int points = 0;

    public static String firstName;
    public static String lastName;
    public static int userID;

    public static String character;


    public static Dialog[] dialogs = new Dialog[]{
            //WEEK 1
            //0
            new Dialog("СЕДМИЦА 1\n" +
                    "Събуждаш се в общежитието(имаш махмурлук от предната вечер), отиваш ли на час?",
                    new String[]{"", "Да", "Не", ""},
                    new int[]{0, 1, 99999, 0},//-
                    new int[]{0, 0, -10, 0},
                    "null.png",
                    "null.png",
                    "morning"
            ),

            //1
            new Dialog("Даваш ли си зор да отидеш на час или ше бегаш?",
                    new String[]{"Да, отивам на час", "Да, ама Краси ще почака", "От къв зор, да не ми е длъжен", ""},
                    new int[]{5, 2, 99999, 0},//-
                    new int[]{4, 0, -4, 0},
                    "Character.png",
                    "null.png",
                    "morning"),

            //2
            new Dialog("Закъсняваш за час, кво смяташ да направиш по този въпрос?",
                    new String[]{"", "Бале го, нищо", "Взимам му кафенце", ""},
                    new int[]{0, 4, 3, 0},//-
                    new int[]{0, -6, 3, 0},
                    "Character.png",
                    "null.png",
                    "entrance"),

            //3
            new Dialog("Закъснял си за часа, но носиш кафенце на Краси.\n" +
                    "Краси: Къде ми е цигарката?",
                    new String[]{"", "Следващия път", "Нещо за голям се взехте", ""},
                    new int[]{0, 5, 5, 0},//-
                    new int[]{0, 0, -1, 0},
                    "Character.png",
                    "Krasi.gif",
                    "room"),

            //4
            new Dialog("Закъснял си за часа.\n" +
                    "Краси: Къде ми е кафенцето?",
                    new String[]{"ЕЕЕЕ вече го изпих", "Нямате ли си???", "Нещо за голям се взехте", ""},
                    new int[]{5, 5, 5, 0},//-
                    new int[]{0, 1, -2, 0},
                    "Character.png",
                    "Krasi.gif",
                    "room"),

            //5
            new Dialog("Краси задава проект, който трябва да е готов в рамките на три седмици, избери проект:",
                    new String[]{"Gay in shape (Фитнес сайт)", "KyrsExchange (Black Market за курсови работи)", "Часът на джойстиците (Симулатор на час при Томов)", "Калкулатор на swing (за три)"},
                    new int[]{6, 6, 6, 6},//-
                    new int[]{75, 85, 99, 50},
                    "Character.png",
                    "Krasi.png",
                    "room"),

            //6
            new Dialog(
                    "Краси тупурка из стаята и минава покрай теб. Какво правиш?",
                    new String[]{"Чешеш кивитата","Разказваш вица за човека с каса бира вместо гъз","Работиш по проекта (Краси ще го има предвид)",""},
                    new int[]{7, 8,11,0},//-
                    new int[]{-2,5,4,0},
                    "Character.png",
                    "Krasi.png",
                    "room"),

            //7
            new Dialog("Краси: Какво си драпаш косматите кивита? Я почвай да работиш!!!",
                    new String[]{"Добре", "Добре", "Добре", "Добре"},
                    new int[]{9,9,9,9},//-
                    new int[]{-3, -1, -7, 2},
                    "Character.png",
                    "KrasiAngry.gif",
                    "room"
            ),

            //8
            new Dialog("Ти: Родил се един човек с каса бира вместо гъз, той цял живот търсил как да оправи проблема си, " +
                    "обикалял много доктори, но без успех. Депресиран той се разхождал по улицата и срещнал една пияница, " +
                    "разказал му проблема си. Пияницата го изслушал внимателно и му казал сутрин рано да отиде на плажа и да се пече по корем до обяд. " +
                    "Човекът без да знае какво да прави вече, решил да го послуша. Сутринта рано отишъл на плажа и се пекъл по корем до обяд. " +
                    "Толкова много се пекал, че бирата станала на гъз.",
                    new String[]{"", "Кво ще кажете господине?", "Смееш се истерично", ""},
                    new int[]{0, 9, 10, 0},//-
                    new int[]{0, 3, -1, 0},
                    "",
                    "",
                    ""
            ),


            //9
            new Dialog("Краси се кефи на вица и ти казва да продължаваш с работата",
                    new String[]{"", "Послушваш го", "", ""},
                    new int[]{0,11,0,0},//-
                    new int[]{0,0,0,0},
                    "Character.png",
                    "Krasi.gif",
                    "room"
            ),


            //10
            new Dialog("Краси се кефи на вица, но ти се чуди на акъла. Казва да продължаваш с работата",
                    new String[]{"", "Послушваш го", "", ""},
                    new int[]{0,11,0,0},//-
                    new int[]{0,0,0,0},
                    "Character.png",
                    "Krasi.gif",
                    "room"
            ),

            //11
            new Dialog("Работиш до края на часа. След това се прибираш",
                    new String[]{"", "Към следващата седмица", "", ""},
                    new int[]{0,12,0,0},//-
                    new int[]{0,0,0,0},
                    "",
                    "",
                    ""
            ),

/* SAMPLE
            new Dialog("",
                    new String[]{"", "", "", ""},
                    new int[]{,,,},//-
                    new int[]{,,,},
                    "",
                    "",
                    ""
            ),
*/

//-------------------------------------WEEK2 IF YOU DON'T SKIP WEEK1--------------------------------------------------//
            //12
            new Dialog("СЕДМИЦА 2\n" +
                    "Събуждаш се, сере ти се много, но има някой в тоалетната. Как постъпваш?",
                    new String[]{"Стискаш бузките и отиваш на час", "Друсаш крушата (в гащите) и отиваш на час", "Чакаш съквартиранта ти да излезе", "Сереш, след това ставаш от леглто"},
                    new int[]{26,13,19,99999},//-
                    new int[]{0,1,-2,0},
                    "null.png",
                    "null.png",
                    "morning"
            ),

            //13
            new Dialog("В час си, Краси надушва падналата круша и пита каква е тази миризма.",
                    new String[]{"Признаваш си", "Правиш се че не знаеш и отваряш всички прозорци", "Обвиняваш Геро магията", "Игнорираш го"},
                    new int[]{14,18,15,17},//-
                    new int[]{1,2,-3,0},
                    "Character.png",
                    "Krasi.png",
                    "room"
            ),

            //14
            new Dialog("Краси те гони с отсъствие и ти пише офоциална забележка \"Ученикът се насра в час!!!\".",
                    new String[]{"", "Хубуу", "Случва се и най-добрите", ""},
                    new int[]{0,16,16,0},//-
                    new int[]{0,-10,-9,0},
                    "Character.png",
                    "KrasiAngry.png",
                    "room"
            ),

            //15
            new Dialog("Геро магията обвинява Гьошев, Гьошев обвинява Йончев, Йончев обвинява Чантов, Чантов обвинява Павлов, Павлов обвинява Петрова, Петрова обвинява Петков, ааа чакай той не е на час.\n" +
                    "Целият час ще протече така ако не предприемеш действия, признаваш ли си?",
                    new String[]{ "","Признаваш си", "Никъв шанс", ""},
                    new int[]{0,14,16,0},//-
                    new int[]{0,1,0,0},
                    "Character.png",
                    "KrasiAngry.png",
                    "room"
            ),

            //16
            new Dialog("Ти се прибираш и си измиваш гъза, но не измиваш вината от душата ти.",
                    new String[]{"", "Към следващата седмица", "", ""},
                    new int[]{0,99999,0,0},//-
                    new int[]{0,-3,0,0},
                    "Character.png",
                    "null.png",
                    "morning"
            ),

            //17
            new Dialog("Всички се чудят защо мирише на \"круши\", но ти си работиш по проекта и така минава целият час.",
                    new String[]{"", "Към следващата седмица", "", ""},
                    new int[]{0,99999,0,0},//-
                    new int[]{0,10,0,0},
                    "Character.png",
                    "null.png",
                    "room"
            ),

            //18
            new Dialog("Всички се разсейват от крякането на пауните и забравят за миризмата, ти си правиш проекта и се радваш, че не са те надушили.",
                    new String[]{"", "Към следващата седмица", "", ""},
                    new int[]{0,99999,0,0},//-
                    new int[]{0,12,0,0},
                    "Character.png",
                    "null.png",
                    "room"
            ),


            //19
            new Dialog("Изля си душата, но закъсняваш за час, кво смяташ да направиш по този въпрос?",
                    new String[]{"", "Бале го, нищо", "Взимам му кафенце", ""},
                    new int[]{0,21,20,0},//-
                    new int[]{0, -6, 3, 0},
                    "Character.png",
                    "null.png",
                    "entrance"),

            //20
            new Dialog("Закъснял си за часа, но носиш кафенце на Краси.\n" +
                    "Краси: Къде ми е цигарката?",
                    new String[]{"", "Следващия път", "Нещо за голям се взехте", ""},
                    new int[]{0,22,22,0},//-
                    new int[]{0, 0, -1, 0},
                    "Character.png",
                    "Krasi.gif",
                    "room"),

            //21
            new Dialog("Закъснял си за часа.\n" +
                    "Краси: Къде ми е кафенцето?",
                    new String[]{"ЕЕЕЕ вече го изпих", "Нямате ли си???", "Нещо за голям се взехте", ""},
                    new int[]{22,22,22,0},//-
                    new int[]{0, 1, -2, 0},
                    "Character.png",
                    "Krasi.gif",
                    "room"),

            //22
            new Dialog("Сядаш си на мястото, смяташ ли да работиш по проекта?",
                    new String[]{"", "Да", "Не", ""},
                    new int[]{0,23,24,0},//-
                    new int[]{0,10,-6,0},
                    "Character.png",
                    "null.png",
                    "room"
            ),

            //23
            new Dialog("Цялият ти час минава в работене по проекта, Краси вижда това и много се радва.",
                    new String[]{"", "Към следващата седмица", "", ""},
                    new int[]{0,99999,0,0},//-
                    new int[]{0,0,0,0},
                    "Character.png",
                    "Krasi.png",
                    "room"
            ),

            //24
            new Dialog("Цялият ти час минава в бездействане, Краси вижда това.\n" +
                    "Краси: Спри да си играеш с джойстика да не ти го завра отзад и да вземе да ти хареса.",
                    new String[]{"", "Прибираш си джойстика", "", ""},
                    new int[]{0,25,0,0},//-
                    new int[]{0,-2,0,0},
                    "Character.png",
                    "KrasiAngry.gif",
                    "room"
            ),

            //25
            new Dialog("Цялият ти час минава в скатаване.",
                    new String[]{"", "Към следващата седмица", "", ""},
                    new int[]{0,99999,0,0},//-
                    new int[]{0,0,0,0},
                    "Character.png",
                    "null.png",
                    "room"
            ),

            //26
            new Dialog("Отиваш на час и се надяваш да не се наакаш по време на часа.",
                    new String[]{"", "Сядаш си на мястото", "", ""},
                    new int[]{0,22,0,0},//-
                    new int[]{0,1,0,0},
                    "Character.png",
                    "null.png",
                    "morning"
            ),
    };



/*
    static Dialog randomDialogStart(){

        ArrayList<Dialog> randomDialogs = new ArrayList<>();
        randomDialogs.add(
                );


        return randomDialogs.get(0);
    }
*/



}
